snlkuharlocal/src/Documents/АктПриемкиМашины/АктПриемкиМашины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПриемкиМашины</name>
  <basedOn>Document.Машина</basedOn>
  <basedOn>Document.КоллективныеРаботы</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.КоллективныеРаботы</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМашины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительГрузополучателя</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительСтраховщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выявлено</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеУпаковки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Повреждения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерCMR</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеПримечания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровереноМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияИмеется</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНекондиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодвижнойСостав</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтрольныеУстройства</name>
    <comment>Пломбы</comment>
    <attributes>
      <name>ИдСтрокиПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Маркировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПНК</name>
    <attributes>
      <name>ПриходнаяНакладная</name>
      <type>
        <types>DocumentRef.ПриходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтрок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппыТоваров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПринятоКоробов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НарушенаЦелостностьУпаковки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтукНеТоварногоВида</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БлочковНеТоварногоВида</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоробовНеТоварногоВида</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Недостача</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Излишки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Брак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасхождений</name>
      <type>
        <types>EnumRef.ТипыРасхождений</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВПНК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комиссия</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Досмотр</name>
    <attributes>
      <name>МестоПроведения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзъятоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставленАкт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/История/История.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>История</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>CatalogRef.Декларация</types>
      <types>CatalogRef.Подразделения</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Контрагенты</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ПунктыДоставки</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Договоры</types>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВводОстатковТМЦ</types>
      <types>DocumentRef.Декларация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Переоценка</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/ВидыВыполняемыхРабот/ВидыВыполняемыхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыВыполняемыхРабот</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВыгрузкаИзАвтомобиля</name>
      <description>Выгрузка из автомобиля</description>
    </items>
    <items>
      <name>ДопОбработка</name>
      <description>Доп обработка</description>
    </items>
    <items>
      <name>ЗагрузкаВАвтомобиль</name>
      <description>Загрузка в автомобиль</description>
    </items>
    <items>
      <name>Комплектация</name>
      <description>Комплектация</description>
    </items>
    <items>
      <name>Маркировка</name>
      <description>Маркировка</description>
    </items>
    <items>
      <name>НаборМаршрутногоЛиста</name>
      <description>Набор маршрутного листа</description>
    </items>
    <items>
      <name>Термоусадка</name>
      <description>Термоусадка</description>
    </items>
  </predefined>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/АктПриемкиМашины/ManagerModule.bsl
Процедура ПечатьАкта(ДокСсылка) Экспорт
	
	Макет = ПолучитьМакет("Акт");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
		
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "АктПриемкиМашины";
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ЗаполнитьЗначенияСвойств(ОблШапка.Параметры, ДокСсылка);
	ОблШапка.Параметры.АдресСклада = Константы.УзелТранспортногоОтдела.Получить().Подразделение.ОсновнойСклад.Адрес;
	ТабДок.Вывести(ОблШапка);
	
	ОблСтрокаКомиссия = Макет.ПолучитьОбласть("СтрокаКомиссии");
	Для Каждого СтрКомиссия из ДокСсылка.Комиссия Цикл
		ЗаполнитьЗначенияСвойств(ОблСтрокаКомиссия.Параметры, СтрКомиссия);
		ТабДок.Вывести(ОблСтрокаКомиссия);
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ОблТранспорт = Макет.ПолучитьОбласть("Транспорт");
	СтрокиПодвижнойСостав = ДокСсылка.ПодвижнойСостав.НайтиСтроки(Новый Структура("Вид", "Автомобиль"));
	Для Каждого Стр ИЗ СтрокиПодвижнойСостав Цикл
		ОблТранспорт.Параметры.Автомобиль = ?(СокрЛП(Стр.Марка) = "", "Автомобиль", СокрЛП(Стр.Марка));
		ОблТранспорт.Параметры.НомерМашины = СокрЛП(Стр.Номер);
	КонецЦикла;
	СтрокиПодвижнойСостав = ДокСсылка.ПодвижнойСостав.НайтиСтроки(Новый Структура("Вид", "Прицеп/Полуприцеп"));
	Для Каждого Стр ИЗ СтрокиПодвижнойСостав Цикл
		ОблТранспорт.Параметры.Прицеп = ?(СокрЛП(Стр.Марка) = "", "Прицеп/Полуприцеп", СокрЛП(Стр.Марка));
		ОблТранспорт.Параметры.НомерПрицепа = СокрЛП(Стр.Номер);
	КонецЦикла;
	СтрокиПодвижнойСостав = ДокСсылка.ПодвижнойСостав.НайтиСтроки(Новый Структура("Вид", "Контейнер"));
	Для Каждого Стр ИЗ СтрокиПодвижнойСостав Цикл
		ОблТранспорт.Параметры.НомерКонтейнера = СокрЛП(Стр.Номер);
	КонецЦикла;
	Если ДокСсылка.СписокПНК.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ПНК", ДокСсылка.СписокПНК[0].ПриходнаяНакладная);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Товары.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.ПриходнаяНакладная.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &ПНК
		|
		|УПОРЯДОЧИТЬ ПО
		|	Товары.Номенклатура.Родитель.ВидНоменклатуры";
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
	
		Если Выборка.Следующий() Тогда
			ОблТранспорт.Параметры.СтранаПроисхождения = ПолучитьСтрануПроисхожденияПоНоменклатуре(Выборка.Номенклатура);
		КонецЕсли;
	КонецЕсли;
	ТабДок.Вывести(ОблТранспорт);
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ОблДосмотр = Макет.ПолучитьОбласть("Досмотр");
	СтрокиГраница = ДокСсылка.Досмотр.НайтиСтроки(Новый Структура("МестоПроведения", "Граница"));
	Для Каждого Стр ИЗ СтрокиГраница Цикл
		ОблДосмотр.Параметры.ЭтоГраница = Истина;
		ОблДосмотр.Параметры.ДатаГраница = Стр.ДатаВремя;
		ОблДосмотр.Параметры.ИзъятоМестГраница = Стр.ИзъятоМест;
		ОблДосмотр.Параметры.СоставленАктГраница = Стр.СоставленАкт;
	КонецЦикла;
	СтрокиТаможня = ДокСсылка.Досмотр.НайтиСтроки(Новый Структура("МестоПроведения", "Таможня"));
	Для Каждого Стр ИЗ СтрокиТаможня Цикл
		ОблДосмотр.Параметры.ЭтоТаможня = Истина;
		ОблДосмотр.Параметры.ДатаТаможня = Стр.ДатаВремя;
		ОблДосмотр.Параметры.ИзъятоМестТаможня = Стр.ИзъятоМест;
		ОблДосмотр.Параметры.СоставленАктТаможня = Стр.СоставленАкт;
	КонецЦикла;
	СтрокиВПути = ДокСсылка.Досмотр.НайтиСтроки(Новый Структура("МестоПроведения", "В пути"));
	Для Каждого Стр ИЗ СтрокиВПути Цикл
		ОблДосмотр.Параметры.ЭтоВПути = Истина;
		ОблДосмотр.Параметры.ДатаВПути = Стр.ДатаВремя;
		ОблДосмотр.Параметры.ИзъятоМестВПути = Стр.ИзъятоМест;
		ОблДосмотр.Параметры.СоставленАктВПути = Стр.СоставленАкт;
	КонецЦикла;
	ТабДок.Вывести(ОблДосмотр);
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ОблКонтрольныеУстройства = Макет.ПолучитьОбласть("КонтрольныеУстройства");
	ЗаполнитьЗначенияСвойств(ОблКонтрольныеУстройства.Параметры, ДокСсылка);
	СтрокиАвтомобиль = ДокСсылка.ПодвижнойСостав.НайтиСтроки(Новый Структура("Вид", "Автомобиль"));
	
	// Кухарь А.Ю.  29.01.2024 начало
	МассивКУ=новый Массив; 
	// Кухарь А.Ю.  29.01.2024 конец
	
	Для Каждого Стр ИЗ СтрокиАвтомобиль Цикл
		СтрокиКУ = ДокСсылка.КонтрольныеУстройства.НайтиСтроки(Новый Структура("ИдСтрокиПС", Стр.ИдСтроки));
		Для Каждого СтрокаКУ ИЗ СтрокиКУ Цикл
			ОблКонтрольныеУстройства.Параметры.АвтомобильКУ = СокрЛП(СтрокаКУ.Маркировка);
			// Кухарь А.Ю.  29.01.2024 начало
			МассивКУ.Добавить(СокрЛП(СтрокаКУ.Маркировка)); 
			// Кухарь А.Ю.  29.01.2024 конец
			
		КонецЦикла;
	КонецЦикла;
	СтрокиПрицеп = ДокСсылка.ПодвижнойСостав.НайтиСтроки(Новый Структура("Вид", "Прицеп/Полуприцеп"));
	Для Каждого Стр ИЗ СтрокиПрицеп Цикл
		СтрокиКУ = ДокСсылка.КонтрольныеУстройства.НайтиСтроки(Новый Структура("ИдСтрокиПС", Стр.ИдСтроки));
		Для Каждого СтрокаКУ ИЗ СтрокиКУ Цикл
			ОблКонтрольныеУстройства.Параметры.ПрицепКУ = СокрЛП(СтрокаКУ.Маркировка);
			// Кухарь А.Ю.  29.01.2024 начало
			МассивКУ.Добавить(СокрЛП(СтрокаКУ.Маркировка)); 
			// Кухарь А.Ю.  29.01.2024 конец
		КонецЦикла;
	КонецЦикла;
	СтрокиКонтейнер = ДокСсылка.ПодвижнойСостав.НайтиСтроки(Новый Структура("Вид", "Контейнер"));
	Для Каждого Стр ИЗ СтрокиКонтейнер Цикл
		СтрокиКУ = ДокСсылка.КонтрольныеУстройства.НайтиСтроки(Новый Структура("ИдСтрокиПС", Стр.ИдСтроки));
		Для Каждого СтрокаКУ ИЗ СтрокиКУ Цикл
			ОблКонтрольныеУстройства.Параметры.КонтейнерКУ = СокрЛП(СтрокаКУ.Маркировка);
			// Кухарь А.Ю.  29.01.2024 начало
			МассивКУ.Добавить(СокрЛП(СтрокаКУ.Маркировка)); 
			// Кухарь А.Ю.  29.01.2024 конец			
		КонецЦикла;
	КонецЦикла;
	
	// Кухарь А.Ю.  29.01.2024 начало
	ПоставщикСтрокой=ВРег(Строка(ОблТранспорт.Параметры.СтранаПроисхождения));
	если ВРег(ПоставщикСтрокой) <> "КИТАЙ"  тогда
		ОблКонтрольныеУстройства.Параметры.НомерTIR=СтрСоединить(МассивКУ,",");
	иначе
		ОблКонтрольныеУстройства.Параметры.НомерTIRКитай=СтрСоединить(МассивКУ,",");
	КонецЕсли;
		//ОблКонтрольныеУстройства.Параметры.КоличествоКоробов=ДокСсылка.СписокПНК.Итог("КоличествоКоробов");
	//КонецЕсли;
	// Кухарь А.Ю.  29.01.2024 конец
	
	ТабДок.Вывести(ОблКонтрольныеУстройства);
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ОблСтрокаПНК = Макет.ПолучитьОбласть("СтрокаПНК");
	Если ДокСсылка.СписокПНК.Количество() > 0 Тогда 
		Для Каждого СтрокаПНК Из ДокСсылка.СписокПНК Цикл
			ЗаполнитьЗначенияСвойств(ОблСтрокаПНК.Параметры, ДокСсылка);
			ЗаполнитьЗначенияСвойств(ОблСтрокаПНК.Параметры, СтрокаПНК);
			ОблСтрокаПНК.Параметры.Номер = СокрЛП(СтрокаПНК.ПриходнаяНакладная.Номер);
			// Кухарь А.Ю.  20.02.2024 начало
			//
			если ВРег(ПоставщикСтрокой) = "КИТАЙ"  тогда
				ОблСтрокаПНК.Параметры.КоличествоКоробовКитай=ОблСтрокаПНК.Параметры.КоличествоКоробов;
				ОблСтрокаПНК.Параметры.КоличествоКоробов="";
				
			КонецЕсли;

			// Кухарь А.Ю.  20.02.2024 конец
			
			
			ТабДок.Вывести(ОблСтрокаПНК);
		КонецЦикла;
	Иначе
		ЗаполнитьЗначенияСвойств(ОблСтрокаПНК.Параметры, ДокСсылка);
		ТабДок.Вывести(ОблСтрокаПНК);
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ОблРасхождения = Макет.ПолучитьОбласть("Расхождения");
	ТабДок.Вывести(ОблРасхождения);
	
	ОблСтрокаТовары = Макет.ПолучитьОбласть("СтрокаТовары");
	Для Каждого СтрТовары из ДокСсылка.Товары Цикл
		ЗаполнитьЗначенияСвойств(ОблСтрокаТовары.Параметры, СтрТовары);
		Если СтрТовары.Недостача <> 0 Тогда
			ОблСтрокаТовары.Параметры.Расхождения = - СтрТовары.Недостача;
		ИначеЕсли СтрТовары.Излишки <> 0 Тогда
			ОблСтрокаТовары.Параметры.Расхождения = СтрТовары.Излишки;
		КонецЕсли;
		ТабДок.Вывести(ОблСтрокаТовары);
	КонецЦикла;
	
	////////////////// УПАКОВКА //////////////////////////////////////////////////////////////
	
	ОблУпаковка = Макет.ПолучитьОбласть("Упаковка");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(СписокПНК.НарушенаЦелостностьУпаковки) КАК НарушенаЦелостностьУпаковки
	|ИЗ
	|	Документ.АктПриемкиМашины.СписокПНК КАК СписокПНК
	|ГДЕ
	|	СписокПНК.Ссылка = &Ссылка";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		НарушенаЦелостностьУпаковки = Выборка.НарушенаЦелостностьУпаковки;
		Если НарушенаЦелостностьУпаковки Тогда
			ОблУпаковка.Параметры.Нарушена = "Нарушена";
		Иначе
			ОблУпаковка.Параметры.Нарушена = "Не нарушена";
		КонецЕсли;
	Иначе
		ОблУпаковка.Параметры.Нарушена = "Не нарушена";
	КонецЕсли;

	ИтогоБрак = ?(ДокСсылка.Товары.Итог("Брак") = 0, "Нет", ДокСсылка.Товары.Итог("Брак"));
	ОблУпаковка.Параметры.ИтогоБрак = ИтогоБрак;
	
	ИтогоКоробовНеТоварногоВида = ?(ДокСсылка.СписокПНК.Итог("КоробовНеТоварногоВида") = 0, "Нет", ДокСсылка.СписокПНК.Итог("КоробовНеТоварногоВида"));
	ОблУпаковка.Параметры.ИтогоКоробовНеТоварногоВида = ИтогоКоробовНеТоварногоВида;
	
	ИтогоБлочковНеТоварногоВида = ?(ДокСсылка.СписокПНК.Итог("БлочковНеТоварногоВида") = 0, "Нет", ДокСсылка.СписокПНК.Итог("БлочковНеТоварногоВида"));
	ОблУпаковка.Параметры.ИтогоБлочковНеТоварногоВида = ИтогоБлочковНеТоварногоВида;
	
	ИтогоШтукНеТоварногоВида = ?(ДокСсылка.СписокПНК.Итог("ШтукНеТоварногоВида") = 0, "Нет", ДокСсылка.СписокПНК.Итог("ШтукНеТоварногоВида"));
	ОблУпаковка.Параметры.ИтогоШтукНеТоварногоВида = ИтогоШтукНеТоварногоВида;
	
	ОблУпаковка.Параметры.ОсобыеПримечания = ?(ПустаяСтрока(СокрЛП(ДокСсылка.Выявлено)), "", СокрЛП(ДокСсылка.Выявлено) + ", ")
			+ ?(ПустаяСтрока(СокрЛП(ДокСсылка.Упаковка)), "", СокрЛП(ДокСсылка.Упаковка) + ", ")
			+ ?(ПустаяСтрока(СокрЛП(ДокСсылка.СостояниеУпаковки)), "", СокрЛП(ДокСсылка.СостояниеУпаковки) + ", ")
			+ ?(ПустаяСтрока(СокрЛП(ДокСсылка.Повреждения)), "", СокрЛП(ДокСсылка.Повреждения) + ", ")
			+ СокрЛП(ДокСсылка.ОсобыеПримечания);
			
	// Кухарь А.Ю.  19.01.2024 начало
	если ДокСсылка.ПровереноМест>0 тогда
		МассивСтрок=ПолучитьСклоненияСтрокиПоЧислу("коробка",ДокСсылка.ПровереноМест,,, "ПД=Именительный");
		для каждого Стр из МассивСтрок цикл
			ОблУпаковка.Параметры.ПровереноМест=Стр;
		КонецЦикла;
	КонецЕсли;	
	ОблУпаковка.Параметры.ИнформацияИмеется=ДокСсылка.ИнформацияИмеется;
	// Кухарь А.Ю.  19.01.2024 конец
	
	// Кухарь А.Ю.  12.02.2024 начало
	//
	ОблУпаковка.Параметры.Некондиция = ?(ДокСсылка.ЕстьНекондиция,"Да","Нет");	 
	// Кухарь А.Ю.  12.02.2024 конец
	
	
	
	//// Кухарь А.Ю.  06.02.2024 начало
	//МассивНекодиции=ДокСсылка.СписокПНК.НайтиСтроки(новый Структура("НарушенаЦелостностьУпаковки"),Истина);
	//если МассивНекодиции.Количество()=0 тогда
	//	Некондиция="Нет";
	//иначе
	//	Некондиция="Да";
	//КонецЕсли;
	//ОблУпаковка.Параметры.Некондиция=Некондиция;
	//// Кухарь А.Ю.  06.02.2024 конец
	//
	
			
	ТабДок.Вывести(ОблУпаковка);
	
	//////////////////////////////////////////////////////////////////////////////////////////
	
	ОблСтрокаУдостоверяем = Макет.ПолучитьОбласть("СтрокаУдостоверяем");
	Для Каждого СтрКомиссия из ДокСсылка.Комиссия Цикл
		ЗаполнитьЗначенияСвойств(ОблСтрокаУдостоверяем.Параметры, СтрКомиссия);
		ТабДок.Вывести(ОблСтрокаУдостоверяем);
	КонецЦикла;
	
	ОблРаботы = Макет.ПолучитьОбласть("Работы");
	ТабДок.Вывести(ОблРаботы);
	
	ОблКоллективныеРаботы = Макет.ПолучитьОбласть("КоллективныеРаботы");
	СтруктураВозврата = ПолучитьИнфоИзКоллективныхРабот(ДокСсылка);
	ЗаполнитьЗначенияСвойств(ОблКоллективныеРаботы.Параметры, СтруктураВозврата);
	ТабДок.Вывести(ОблКоллективныеРаботы);
	
	ЗаполнениеДокументов.НапечататьТабличныйДокумент(ТабДок,,,"Акт приемки машины");
	
КонецПроцедуры

Функция ПолучитьИнфоИзКоллективныхРабот(ДокСсылка) Экспорт
	
	СтруктураВозврата = Новый Структура("НачалоВыгрузкиДата, НачалоВыгрузкиВремя, ЗавершениеВыгрузкиДата, ЗавершениеВыгрузкиВремя, Трудозатраты");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("Дата", Константы.ДатаЗапретаРедактирования.Получить()-6*30*24*3600);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Накладные.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТЗ1
	|ИЗ
	|	Документ.КоллективныеРаботы.Накладные КАК Накладные
	|ГДЕ
	|	Накладные.Ссылка.Проведен
	|	И Накладные.Накладная В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				СписокПНК.ПриходнаяНакладная
	|			ИЗ
	|				Документ.АктПриемкиМашины.СписокПНК КАК СписокПНК
	|			ГДЕ
	|				СписокПНК.Ссылка = &ДокСсылка)
	|	И Накладные.Ссылка.Дата >= &Дата
	|	И Накладные.Ссылка.ВидРаботы = ЗНАЧЕНИЕ(Справочник.ВидыВыполняемыхРабот.ВыгрузкаИзАвтомобиля)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Данные.Сотрудник) КАК КоличествоСотрудников,
	|	МИНИМУМ(Данные.НачалоВыполнения) КАК НачалоВыполнения,
	|	МАКСИМУМ(Данные.ОкончаниеВыполнения) КАК ОкончаниеВыполнения,
	|	СУММА(Данные.ЧеловекоЧасов) КАК КоличествоЧеловекоЧасов
	|ИЗ
	|	ТЗ1 КАК ТЗ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоллективныеРаботы.Данные КАК Данные
	|		ПО ТЗ1.Ссылка = Данные.Ссылка";
	
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаТЧ = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ИтогоКоличествоСотрудников = 0;
	ИтогоКоличествоЧеловекоЧасов = 0;
	ИтогоСредниеЧасы = 0;
	
	Для Каждого СтрТч из ВыборкаТЧ Цикл
		
		Если СтрТч.НачалоВыполнения = NULL Тогда
			Продолжить;
		КонецЕсли;
		
		ИтогоСредниеЧасы = ИтогоСредниеЧасы + ?(СтрТч.КоличествоСотрудников = 0, 0, Окр(СтрТч.КоличествоЧеловекоЧасов/СтрТч.КоличествоСотрудников,1));
		
		СтруктураВозврата.НачалоВыгрузкиДата = Формат(СтрТч.НачалоВыполнения, "ДФ=дд.ММ.гггг");
		СтруктураВозврата.НачалоВыгрузкиВремя = Формат(СтрТч.НачалоВыполнения, "ДФ=ЧЧ:мм:сс");
		СтруктураВозврата.ЗавершениеВыгрузкиДата = Формат(СтрТч.ОкончаниеВыполнения, "ДФ=дд.ММ.гггг");
		СтруктураВозврата.ЗавершениеВыгрузкиВремя = Формат(СтрТч.ОкончаниеВыполнения, "ДФ=ЧЧ:мм:сс");
		
		ИтогоКоличествоСотрудников = ИтогоКоличествоСотрудников + СтрТч.КоличествоСотрудников;
		ИтогоКоличествоЧеловекоЧасов = ИтогоКоличествоЧеловекоЧасов + СтрТч.КоличествоЧеловекоЧасов; 

	КонецЦикла;
	
	Если ИтогоКоличествоСотрудников > 0 Тогда
		СтруктураВозврата.Трудозатраты = Строка(ИтогоКоличествоСотрудников) + " чел.*" + Строка(ИтогоСредниеЧасы) + " = " + Строка(ИтогоКоличествоЧеловекоЧасов);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьСтрануПроисхожденияПоНоменклатуре(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(Номенклатура.Родитель.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) КАК СтранаПроисхождения
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И Номенклатура.Родитель.Страна <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СтранаПроисхождения;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ИсторияСрезПоследних.Значение.СтранаПроисхождения <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ИсторияСрезПоследних.Значение.СтранаПроисхождения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|	КОНЕЦ КАК СтранаПроисхождения
	|ИЗ
	|	РегистрСведений.История.СрезПоследних(
	|			&Период,
	|			Объект = &Номенклатура
	|				И Реквизит = ""НомерГТД"") КАК ИсторияСрезПоследних
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ИсторияСрезПоследних.Значение) = ТИП(Справочник.ГТД)
	|	И ИсторияСрезПоследних.Значение.СтранаПроисхождения <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СтранаПроисхождения;
	КонецЦикла;
	
	Возврат Справочники.КлассификаторСтранМира.ПустаяСсылка();
	
КонецФункции
